<template>
  <div>
    <div class="m_5 app-container">
      <p>一、总则</p>
      <p>
        本用户注册协议（以下简称“本协议”）是注册用户（以下简称“用户”）（包括彩民用户、实体彩站用户）接受彩乐产品（包括彩乐圈、彩乐彩站版）和服务时适用的通用条款。因此，请您在注册成为彩乐用户前或使用彩乐的产品和服务前仔细阅读本协议的所有内容。
      </p>
      <p>1、用户了解并同意：</p>
      <p>①用户只要按照注册流程完成注册，就已接受了本协议及彩乐公布的各项服务规则，并愿意受其约束。如果发生纠纷，用户不得以未仔细阅读为由进行抗辩。</p>
      <p>②彩乐有权随时更改本协议及相关服务规则。修改本协议时，彩乐将于相关页面公告修改的事实，有权不对用户进行个别通知。用户应该查阅彩乐相关公告，以了解本协议及彩乐服务规则的变化。</p>
      <p>
        2、若用户不同意本协议或相关服务规则，或者不同意彩乐作出的修改，用户可以主动停止使用彩乐提供的产品和服务，如果在彩乐修改协议或服务规则后，用户仍继续使用彩乐提供的产品和服务，即表示用户同意彩乐对本协议及相关服务规则所做的所有修改。由于用户在本协议变更后因未熟悉公告规定而引起的损失，彩乐将不会承担任何责任。
      </p>
      <p>二、账号管理</p>
      <p>
        1、用户一旦注册成功，将可以登录使用彩乐产品和服务。用户可随时根据需要更改密码。用户须对注册用户名和密码安全负全部责任。另外，每个用户都要对以其注册用户名进行的所有活动和事件负全责。用户若发现任何非法使用账号或存在安全漏洞的情况，请立即通告彩乐。
      </p>
      <p>2、彩民用户（以下简称“彩民”）须向彩乐提供真实个人信息，并允许彩乐将相关信息展示给相关方。</p>
      <p>3、实体彩站用户（以下简称“彩站”）须向彩乐提供真实个人信息、彩票站信息，并允许彩乐将相关信息展示给相关方。一经发现彩站信息虚假，彩乐有权终止向该彩站提供服务。</p>
      <p>4、彩乐发现用户违反服务条款，或用户的行为具有风险时，彩乐有权暂停或终止向该用户提供服务。</p>
      <p>三、产品和服务</p>
      <p>1、彩乐包含彩乐圈，彩乐彩站版两款产品。彩乐圈向彩民提供选号预约，购彩记账等服务。彩乐彩站版向彩站提供售彩记账，客户管理等服务。</p>
      <p>2、彩民，彩站使用彩乐提供的记账服务。应当认可并遵守下列记账规则：</p>
      <p>①预存：彩民通过微信（或其它支付方式）给彩站转账，彩站应当给彩民预存记账，并上传凭证。</p>
      <p>②调账：彩站在需要对彩民调账的情况下，经彩民同意后，彩站应当给彩民调账记账，并上传凭证。</p>
      <p>③清账：彩民发起清账，彩站通过微信（或其它支付方式）给彩民转账。彩站上传凭证完成清账记账。</p>
      <p>④自购：彩民选号预约自购，彩站出票上传彩票拍照完成自购记账。</p>
      <p>⑤合买：彩民选号预约合买或参与合买，彩站出票上传彩票拍照完成合买记账。</p>
      <p>⑥保底：彩民选号预约合买保底，未认购部分由保底承接，彩站出票上传彩票拍照完成保底记账。</p>
      <p>⑦派奖：彩站对托管彩票兑奖后，彩站应当给彩民派奖记账。</p>
      <p>⑧记账过程中所有金额计算按照四舍五入保留两位小数。</p>
      <p>3、彩站、彩民使用彩乐提供产品和服务，应认可并遵守下列服务协议：</p>
      <p>①、彩民应当使用合法资金购彩。彩民应当扫码添加熟悉的彩站，确保彩站真实可靠。</p>
      <p>②、彩站不可以向用户提供刷信用卡等资金服务。彩站负责售彩出票，彩票托管，资金结算，对彩民的托管彩票安全，托管资金安全负全部责任。</p>
      <p>③、彩站应当在当期彩票开奖30分钟前上传彩票拍照到彩乐彩站版以供彩民查验。彩票拍照应遮挡部分信息，防止彩票中奖被冒领。彩票拍照应确保选号信息，彩站信息，出票时间，序列号前后8位清晰可见，作为出票凭证。</p>
      <p>④、彩站在当期彩票开奖30分钟前未能上传彩票拍照到彩乐彩站版，视为未出票。同一次选号预约，已出票彩票归属彩民。彩站未出票将解冻彩民预约购票金额。</p>
      <p>
        ⑤、彩民发现彩站出票与预约选号不符，可在当期彩票开奖10分钟前微信联系彩站重新出票。彩站重新出票上传彩票拍照后，原错号彩票归属彩站。彩站未能重新出票上传彩票拍照，彩站应当退还彩民当张彩票购彩金额。如果彩站出票与预约选号不符，彩民未在当期彩票开奖10分钟前联系彩站重新出票，则错号彩票归属彩民。
      </p>
      <p>⑥、彩民可以到彩站取回自购彩票，彩站应予以取票。彩站需记录取票过程，并让彩民在微信确认，防止发生纠纷。合买彩票归属所有认购彩民，不可以单方取票。</p>
      <p>⑦、彩民未取票的所有彩票由彩站负责托管，彩票托管期为60天。托管彩票属于彩民，彩民有权要求取回，查验托管期内的彩票。彩站对丢失，损坏，侵占彩民托管彩票的行为负全部责任。</p>
      <p>⑧、彩站停止使用彩乐产品和服务前应当通知彩民取回托管彩票，或继续履行托管义务。彩站停止使用彩乐产品和服务后须将彩民资金返还彩民。</p>
      <p>⑨、彩民与彩站发生彩票，资金等纠纷由彩民与彩站双方协商解决；协商不成的，彩民可以向彩站所在地人民法院提起诉讼。彩站侵占彩民彩票，资金金额达到侵占罪立案标准金额10000元时，可以向当地公安机关报案。</p>
      <p>四、拒绝提供担保</p>
      <p>1、用户个人对产品服务的使用承担风险。彩乐对此不作任何类型的担保，不论是明确的或隐含的。彩乐不担保服务一定能满足用户的要求，也不担保服务不会受中断。对服务的及时性，安全性，出错发生都不作担保。</p>
      <p>2、彩站、彩民对双方间的商业行为承担风险。彩乐不对彩站、彩民双方提供任何类型的担保。</p>
      <p>五、有限责任</p>
      <p>彩乐对任何直接、间接、偶然、特殊及继起的损害不负责任，这些损害可能来自：不正当使用产品服务，非法使用系统漏洞传送信息。这些行为都有可能会导致用户受损，所以彩乐事先提出这种损害的可能性。</p>
      <p>六、责任限制</p>
      <p>1、如因不可抗力或其他彩乐无法控制的原因使系统崩溃或无法正常使用导致产品无法完成或丢失有关的信息、记录等，彩乐不承担责任。但是彩乐会尽可能合理地协助处理善后事宜，并努力使客户免受经济损失。</p>
      <p>
        2、除了彩乐的使用条件中规定的其它限制和除外情况之外，对于因服务而引起的或与之有关的任何直接的、间接的、特殊的、附带的、后果性的或惩罚性的损害，或任何其它性质的损害，彩乐、彩乐的董事、管理人员、研发人员、雇员、代理或其它代表在任何情况下都不承担责任。
      </p>
      <p>七、法律管辖和适用</p>
      <p>1、如发生彩乐服务条款与中国法律相抵触时，则这些条款将完全按法律规定重新解释，而其它合法条款则依旧保持对用户产生法律效力和影响。</p>
      <p>2、本协议的规定是可分割的，如本协议任何规定被裁定为无效或不可执行，该规定可被删除而其余条款应予以执行。</p>
      <p>3、如双方就本协议内容或其执行发生任何争议，双方应尽力友好协商解决；协商不成时，任何一方均可向彩乐所在地的人民法院提起诉讼。</p>
      <p>八、其他规定</p>
      <p>1、如本协议中的任何内容无论因何种原因完全或部分无效或不具有执行力，本协议的其余内容仍应有效并且对协议各方有约束力。</p>
      <p>2、本协议中的标题仅为方便而设，不具法律或契约效果。</p>
    </div>

    <div class="fixed-bottom p_2">
      <a-button
        type="primary"
        block
        @click="clickBtn"
      >我已阅读并同意</a-button>
    </div>
  </div>
</template>

<script>
  export default {
    methods: {
      clickBtn() {
        this.$root.$emit('agree', true)
        this.$router.back()
      }
    }
  }
</script>
